# InsertCombinedParameterField Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..InsertCombinedParameterField Method
ScheduleDefinition Class See Also
---
Adds a combined parameter field at the specified position in the list.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ScheduleField InsertCombinedParameterField(
	IList<TableCellCombinedParameterData> data,
	string fieldName,
	int index
)
```

Visual Basic
---
```text
Public Function InsertCombinedParameterField ( _
	data As IList(Of TableCellCombinedParameterData), _
	fieldName As String, _
	index As Integer _
) As ScheduleField
```

Visual C++
---
```text
public:
ScheduleField^ InsertCombinedParameterField(
	IList<TableCellCombinedParameterData^>^ data,
	String^ fieldName,
	int index
)
```

# ### Parameters
data
    Type: System.Collections.Generic..::..IList<(Of <(<'TableCellCombinedParameterData>)>)> The combined parameters array.
fieldName
    Type: System..::..String The field name.
index
    Type: System..::..Int32 The index in the list of fields.
# ### Return Value
The new field.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | index is not a valid insert position. |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace